{
 "version": "1.0",
 "truncation": null,
 "padding": null,
 "added_tokens": [
  {
   "id": 256,
   "special": true,
   "content": "<|endoftext|>",
   "single_word": false,
   "lstrip": false,
   "rstrip": false,
   "normalized": true
  }
 ],
 "normalizer": null,
 "pre_tokenizer": {
  "type": "ByteLevel",
  "add_prefix_space": false,
  "trim_offsets": true
 },
 "post_processor": {
  "type": "ByteLevel",
  "add_prefix_space": true,
  "trim_offsets": false
 },
 "decoder": {
  "type": "ByteLevel",
  "add_prefix_space": true,
  "trim_offsets": true
 },
 "model": {
  "type": "BPE",
  "dropout": null,
  "unk_token": null,
  "continuing_subword_prefix": "",
  "end_of_word_suffix": "",
  "fuse_unk": false,
  "vocab": {
   "膧": 0,
   "膩": 1,
   "膫": 2,
   "膬": 3,
   "膭": 4,
   "膮": 5,
   "膯": 6,
   "膰": 7,
   "膱": 8,
   "膲": 9,
   "膴": 10,
   "膵": 11,
   "膶": 12,
   "膷": 13,
   "膸": 14,
   "膹": 15,
   "膼": 16,
   "膽": 17,
   "膾": 18,
   "膿": 19,
   "臄": 20,
   "臅": 21,
   "臇": 22,
   "臈": 23,
   "臉": 24,
   "臋": 25,
   "臍": 26,
   "臎": 27,
   "臏": 28,
   "臐": 29,
   "臑": 30,
   "臒": 31,
   "臓": 32,
   "!": 33,
   "\"": 34,
   "#": 35,
   "$": 36,
   "%": 37,
   "&": 38,
   "'": 39,
   "(": 40,
   ")": 41,
   "*": 42,
   "+": 43,
   ",": 44,
   "-": 45,
   ".": 46,
   "/": 47,
   "0": 48,
   "1": 49,
   "2": 50,
   "3": 51,
   "4": 52,
   "5": 53,
   "6": 54,
   "7": 55,
   "8": 56,
   "9": 57,
   ":": 58,
   ";": 59,
   "<": 60,
   "=": 61,
   ">": 62,
   "?": 63,
   "@": 64,
   "A": 65,
   "B": 66,
   "C": 67,
   "D": 68,
   "E": 69,
   "F": 70,
   "G": 71,
   "H": 72,
   "I": 73,
   "J": 74,
   "K": 75,
   "L": 76,
   "M": 77,
   "N": 78,
   "O": 79,
   "P": 80,
   "Q": 81,
   "R": 82,
   "S": 83,
   "T": 84,
   "U": 85,
   "V": 86,
   "W": 87,
   "X": 88,
   "Y": 89,
   "Z": 90,
   "[": 91,
   "\\": 92,
   "]": 93,
   "^": 94,
   "_": 95,
   "`": 96,
   "a": 97,
   "b": 98,
   "c": 99,
   "d": 100,
   "e": 101,
   "f": 102,
   "g": 103,
   "h": 104,
   "i": 105,
   "j": 106,
   "k": 107,
   "l": 108,
   "m": 109,
   "n": 110,
   "o": 111,
   "p": 112,
   "q": 113,
   "r": 114,
   "s": 115,
   "t": 116,
   "u": 117,
   "v": 118,
   "w": 119,
   "x": 120,
   "y": 121,
   "z": 122,
   "{": 123,
   "|": 124,
   "}": 125,
   "~": 126,
   "摹": 127,
   "蘑": 128,
   "模": 129,
   "膜": 130,
   "磨": 131,
   "摩": 132,
   "魔": 133,
   "抹": 134,
   "末": 135,
   "莫": 136,
   "墨": 137,
   "默": 138,
   "沫": 139,
   "漠": 140,
   "寞": 141,
   "陌": 142,
   "谋": 143,
   "牟": 144,
   "某": 145,
   "拇": 146,
   "牡": 147,
   "亩": 148,
   "姆": 149,
   "母": 150,
   "墓": 151,
   "暮": 152,
   "幕": 153,
   "募": 154,
   "慕": 155,
   "木": 156,
   "目": 157,
   "艀": 158,
   "艁": 159,
   "艂": 160,
   "隆": 161,
   "垄": 162,
   "拢": 163,
   "陇": 164,
   "楼": 165,
   "娄": 166,
   "搂": 167,
   "篓": 168,
   "漏": 169,
   "陋": 170,
   "芦": 171,
   "卢": 172,
   "艃": 173,
   "庐": 174,
   "炉": 175,
   "掳": 176,
   "卤": 177,
   "虏": 178,
   "鲁": 179,
   "麓": 180,
   "碌": 181,
   "露": 182,
   "路": 183,
   "赂": 184,
   "鹿": 185,
   "潞": 186,
   "禄": 187,
   "录": 188,
   "陆": 189,
   "戮": 190,
   "驴": 191,
   "脌": 192,
   "脕": 193,
   "脗": 194,
   "脙": 195,
   "脛": 196,
   "脜": 197,
   "脝": 198,
   "脟": 199,
   "脠": 200,
   "脡": 201,
   "脢": 202,
   "脣": 203,
   "脤": 204,
   "脥": 205,
   "脦": 206,
   "脧": 207,
   "脨": 208,
   "脩": 209,
   "脪": 210,
   "脫": 211,
   "脭": 212,
   "脮": 213,
   "脰": 214,
   "脳": 215,
   "脴": 216,
   "脵": 217,
   "脷": 218,
   "脹": 219,
   "脺": 220,
   "脻": 221,
   "脼": 222,
   "脽": 223,
   "脿": 224,
   "谩": 225,
   "芒": 226,
   "茫": 227,
   "盲": 228,
   "氓": 229,
   "忙": 230,
   "莽": 231,
   "猫": 232,
   "茅": 233,
   "锚": 234,
   "毛": 235,
   "矛": 236,
   "铆": 237,
   "卯": 238,
   "茂": 239,
   "冒": 240,
   "帽": 241,
   "貌": 242,
   "贸": 243,
   "么": 244,
   "玫": 245,
   "枚": 246,
   "梅": 247,
   "酶": 248,
   "霉": 249,
   "煤": 250,
   "没": 251,
   "眉": 252,
   "媒": 253,
   "镁": 254,
   "每": 255,
   "<|endoftext|>": 256,
   "th": 257,
   "the": 258,
   "in": 259,
   "ing": 260
  },
  "merges": [
   [
    "t",
    "h"
   ],
   [
    "th",
    "e"
   ],
   [
    "i",
    "n"
   ],
   [
    "in",
    "g"
   ]
  ]
 }
}
