{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":256,"special":true,"content":"<|endoftext|>","single_word":false,"lstrip":false,"rstrip":false,"normalized":true}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true},"post_processor":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":false},"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true},"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":"","end_of_word_suffix":"","fuse_unk":false,"vocab":{"\u0100":0,"\u0101":1,"\u0102":2,"\u0103":3,"\u0104":4,"\u0105":5,"\u0106":6,"\u0107":7,"\u0108":8,"\u0109":9,"\u010a":10,"\u010b":11,"\u010c":12,"\u010d":13,"\u010e":14,"\u010f":15,"\u0110":16,"\u0111":17,"\u0112":18,"\u0113":19,"\u0114":20,"\u0115":21,"\u0116":22,"\u0117":23,"\u0118":24,"\u0119":25,"\u011a":26,"\u011b":27,"\u011c":28,"\u011d":29,"\u011e":30,"\u011f":31,"\u0120":32,"!":33,"\"":34,"#":35,"$":36,"%":37,"&":38,"'":39,"(":40,")":41,"*":42,"+":43,",":44,"-":45,".":46,"/":47,"0":48,"1":49,"2":50,"3":51,"4":52,"5":53,"6":54,"7":55,"8":56,"9":57,":":58,";":59,"<":60,"=":61,">":62,"?":63,"@":64,"A":65,"B":66,"C":67,"D":68,"E":69,"F":70,"G":71,"H":72,"I":73,"J":74,"K":75,"L":76,"M":77,"N":78,"O":79,"P":80,"Q":81,"R":82,"S":83,"T":84,"U":85,"V":86,"W":87,"X":88,"Y":89,"Z":90,"[":91,"\\":92,"]":93,"^":94,"_":95,"`":96,"a":97,"b":98,"c":99,"d":100,"e":101,"f":102,"g":103,"h":104,"i":105,"j":106,"k":107,"l":108,"m":109,"n":110,"o":111,"p":112,"q":113,"r":114,"s":115,"t":116,"u":117,"v":118,"w":119,"x":120,"y":121,"z":122,"{":123,"|":124,"}":125,"~":126,"\u0121":127,"\u0122":128,"\u0123":129,"\u0124":130,"\u0125":131,"\u0126":132,"\u0127":133,"\u0128":134,"\u0129":135,"\u012a":136,"\u012b":137,"\u012c":138,"\u012d":139,"\u012e":140,"\u012f":141,"\u0130":142,"\u0131":143,"\u0132":144,"\u0133":145,"\u0134":146,"\u0135":147,"\u0136":148,"\u0137":149,"\u0138":150,"\u0139":151,"\u013a":152,"\u013b":153,"\u013c":154,"\u013d":155,"\u013e":156,"\u013f":157,"\u0140":158,"\u0141":159,"\u0142":160,"\u00a1":161,"\u00a2":162,"\u00a3":163,"\u00a4":164,"\u00a5":165,"\u00a6":166,"\u00a7":167,"\u00a8":168,"\u00a9":169,"\u00aa":170,"\u00ab":171,"\u00ac":172,"\u0143":173,"\u00ae":174,"\u00af":175,"\u00b0":176,"\u00b1":177,"\u00b2":178,"\u00b3":179,"\u00b4":180,"\u00b5":181,"\u00b6":182,"\u00b7":183,"\u00b8":184,"\u00b9":185,"\u00ba":186,"\u00bb":187,"\u00bc":188,"\u00bd":189,"\u00be":190,"\u00bf":191,"\u00c0":192,"\u00c1":193,"\u00c2":194,"\u00c3":195,"\u00c4":196,"\u00c5":197,"\u00c6":198,"\u00c7":199,"\u00c8":200,"\u00c9":201,"\u00ca":202,"\u00cb":203,"\u00cc":204,"\u00cd":205,"\u00ce":206,"\u00cf":207,"\u00d0":208,"\u00d1":209,"\u00d2":210,"\u00d3":211,"\u00d4":212,"\u00d5":213,"\u00d6":214,"\u00d7":215,"\u00d8":216,"\u00d9":217,"\u00da":218,"\u00db":219,"\u00dc":220,"\u00dd":221,"\u00de":222,"\u00df":223,"\u00e0":224,"\u00e1":225,"\u00e2":226,"\u00e3":227,"\u00e4":228,"\u00e5":229,"\u00e6":230,"\u00e7":231,"\u00e8":232,"\u00e9":233,"\u00ea":234,"\u00eb":235,"\u00ec":236,"\u00ed":237,"\u00ee":238,"\u00ef":239,"\u00f0":240,"\u00f1":241,"\u00f2":242,"\u00f3":243,"\u00f4":244,"\u00f5":245,"\u00f6":246,"\u00f7":247,"\u00f8":248,"\u00f9":249,"\u00fa":250,"\u00fb":251,"\u00fc":252,"\u00fd":253,"\u00fe":254,"\u00ff":255,"<|endoftext|>":256},"merges":[]}}
