{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":256,"special":true,"content":"<|endoftext|>","single_word":false,"lstrip":false,"rstrip":false,"normalized":true}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true},"post_processor":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":false},"decoder":{"type":"ByteLevel","add_prefix_space":true,"trim_offsets":true},"model":{"dropout":null,"unk_token":null,"continuing_subword_prefix":"","end_of_word_suffix":"","fuse_unk":false,"vocab":{"ДҖ":0,"ДҒ":1,"ДӮ":2,"Дғ":3,"Д„":4,"Д…":5,"ДҶ":6,"ДҮ":7,"ДҲ":8,"Дү":9,"ДҠ":10,"ДӢ":11,"ДҢ":12,"ДҚ":13,"ДҺ":14,"ДҸ":15,"Дҗ":16,"Д‘":17,"Д’":18,"Д“":19,"Д”":20,"Д•":21,"Д–":22,"Д—":23,"Дҳ":24,"Дҷ":25,"Дҡ":26,"Дӣ":27,"Дң":28,"Дқ":29,"Дһ":30,"Дҹ":31,"Д ":32,"!":33,"\"":34,"#":35,"$":36,"%":37,"&":38,"'":39,"(":40,")":41,"*":42,"+":43,",":44,"-":45,".":46,"/":47,"0":48,"1":49,"2":50,"3":51,"4":52,"5":53,"6":54,"7":55,"8":56,"9":57,":":58,";":59,"<":60,"=":61,">":62,"?":63,"@":64,"A":65,"B":66,"C":67,"D":68,"E":69,"F":70,"G":71,"H":72,"I":73,"J":74,"K":75,"L":76,"M":77,"N":78,"O":79,"P":80,"Q":81,"R":82,"S":83,"T":84,"U":85,"V":86,"W":87,"X":88,"Y":89,"Z":90,"[":91,"\\":92,"]":93,"^":94,"_":95,"`":96,"a":97,"b":98,"c":99,"d":100,"e":101,"f":102,"g":103,"h":104,"i":105,"j":106,"k":107,"l":108,"m":109,"n":110,"o":111,"p":112,"q":113,"r":114,"s":115,"t":116,"u":117,"v":118,"w":119,"x":120,"y":121,"z":122,"{":123,"|":124,"}":125,"~":126,"ДЎ":127,"Дў":128,"ДЈ":129,"ДӨ":130,"ДҘ":131,"ДҰ":132,"Д§":133,"ДЁ":134,"Д©":135,"ДӘ":136,"Д«":137,"Д¬":138,"Дӯ":139,"Д®":140,"ДҜ":141,"Д°":142,"Дұ":143,"ДІ":144,"Ді":145,"Дҙ":146,"Дө":147,"Д¶":148,"Д·":149,"Дё":150,"Д№":151,"Дә":152,"Д»":153,"Дј":154,"ДҪ":155,"Дҫ":156,"Дҝ":157,"ЕҖ":158,"ЕҒ":159,"ЕӮ":160,"ВЎ":161,"Вў":162,"ВЈ":163,"ВӨ":164,"ВҘ":165,"ВҰ":166,"В§":167,"ВЁ":168,"В©":169,"ВӘ":170,"В«":171,"В¬":172,"Еғ":173,"В®":174,"ВҜ":175,"В°":176,"Вұ":177,"ВІ":178,"Ві":179,"Вҙ":180,"Вө":181,"В¶":182,"В·":183,"Вё":184,"В№":185,"Вә":186,"В»":187,"Вј":188,"ВҪ":189,"Вҫ":190,"Вҝ":191,"ГҖ":192,"ГҒ":193,"ГӮ":194,"Гғ":195,"Г„":196,"Г…":197,"ГҶ":198,"ГҮ":199,"ГҲ":200,"Гү":201,"ГҠ":202,"ГӢ":203,"ГҢ":204,"ГҚ":205,"ГҺ":206,"ГҸ":207,"Гҗ":208,"Г‘":209,"Г’":210,"Г“":211,"Г”":212,"Г•":213,"Г–":214,"Г—":215,"Гҳ":216,"Гҷ":217,"Гҡ":218,"Гӣ":219,"Гң":220,"Гқ":221,"Гһ":222,"Гҹ":223,"Г ":224,"ГЎ":225,"Гў":226,"ГЈ":227,"ГӨ":228,"ГҘ":229,"ГҰ":230,"Г§":231,"ГЁ":232,"Г©":233,"ГӘ":234,"Г«":235,"Г¬":236,"Гӯ":237,"Г®":238,"ГҜ":239,"Г°":240,"Гұ":241,"ГІ":242,"Гі":243,"Гҙ":244,"Гө":245,"Г¶":246,"Г·":247,"Гё":248,"Г№":249,"Гә":250,"Г»":251,"Гј":252,"ГҪ":253,"Гҫ":254,"Гҝ":255,"<|endoftext|>":256,"th":257,"the":258,"in":259,"ing":260},"merges":[["t","h"],["th","e"],["i","n"],["in","g"]]}}
